IDEA StatiCa Open Model
CutBeamByBeamData.Orientation Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Cut Orientation
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CutOrientation Orientation { get; set; }
Public Property Orientation As CutOrientation
	Get
	Set
public:
property CutOrientation Orientation {
	CutOrientation get ();
	void set (CutOrientation value);
}
Property Value
Type: CutOrientation
See Also
Reference
CutBeamByBeamData Class
IdeaRS.OpenModel.Connection Namespace